# MERGING OF INSTACART DATASETS

## 1. Importing Datasets

In [2]:
# importing libraries
import pandas as pd
import numpy as np

### A. Importing and cleaning orders dataset

In [3]:
# importing order dataset and assigning to dataframe order_df
order_df = pd.read_csv('/Volumes/external_drive/Instacart/Data/Original Data/orders.csv')

In [5]:
order_df.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [6]:
# dropping eval_set column as it not needed for analysis
order_df = order_df.drop('eval_set', axis=1)

In [7]:
# checking for missing values
order_df.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [8]:
# checking the values under the days_since_prior_order column are caused by first time orders
order_df['user_id'].nunique()

206209

The NaN values under the days_since_prior_order column are a result of the order being the first order the customer has made and hence the number of days since the prior order cannot be calculated. The NaN value count is the same as teh count of user_id's, these values will thus not be removed and can be used to identify first time orders.

In [9]:
# checking for duplicates
order_df[order_df.duplicated()]

Empty DataFrame
Columns: [order_id, user_id, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

In [10]:
# describing the data and checking for any anomalies
order_df.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [11]:
# checking data type
order_df.dtypes

order_id                    int64
user_id                     int64
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [114]:
# checking shape 
order_df.shape

(3421083, 6)

### B. Importing and cleaning products dataset

In [12]:
# importing product dataset and assigning to dataframe product_df
product_df = pd.read_csv('/Volumes/external_drive/Instacart/Data/Original Data/products.csv')

In [13]:
product_df.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [14]:
# checking for missing values
product_df.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [16]:
# identifying missing values for further analysis
product_df[product_df['product_name'].isnull() == True]

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [17]:
# checking shape
product_df.shape

(49693, 5)

In [21]:
# removing missing values (not possible to impute values for product_name)
product_df.dropna(inplace=True)
product_df.shape

(49677, 5)

In [20]:
# checking for duplicates
product_df[product_df.duplicated()]

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [22]:
# dropping duplicates
product_df.drop_duplicates(inplace=True)
product_df.shape

(49672, 5)

In [23]:
# describing the data and checking for any anomalies
product_df.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

In [25]:
# checking maximum values for prices as 99999 seems to be an error 
product_df['prices'].sort_values(ascending = False).drop_duplicates()

33666    99999.0
21554    14900.0
19392       25.0
9896        24.9
26078       24.8
          ...
21525        1.4
29335        1.3
19224        1.2
19388        1.1
42345        1.0
Name: prices, Length: 242, dtype: float64

In [29]:
# identifying mispriced products
product_df.loc[(product_df['prices'] == 14900) | (product_df['prices'] == 99999)].head()

,product_id,product_name,aisle_id,department_id,prices
21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,14900.0
33666,33664,2 % Reduced Fat Milk,84,16,99999.0

In [30]:
# replacing incorrect values with correct values
product_df['prices'] = product_df['prices'].replace({99999: 9.99, 14900: 14.9})

In [31]:
product_df['prices'].sort_values(ascending = False).drop_duplicates()

9020     25.0
14207    24.9
22193    24.8
22956    24.7
24884    24.6
         ...
21525     1.4
29335     1.3
19224     1.2
19388     1.1
42345     1.0
Name: prices, Length: 241, dtype: float64

In [32]:
# checking data type
product_df.dtypes

product_id         int64
product_name      object
aisle_id           int64
department_id      int64
prices           float64
dtype: object

In [33]:
# checking shape
product_df.shape

(49672, 5)

### C. Importing and cleaning departments dataset

In [34]:
# importing department dataset and assigning to dataframe department_df
department_df = pd.read_csv('/Volumes/external_drive/Instacart/Data/Original Data/departments.csv')

In [35]:
department_df.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [36]:
# checking for missing values
department_df.isnull().sum()

department_id    0
department       0
dtype: int64

In [37]:
# checking for duplicates
department_df[department_df.duplicated()]

Empty DataFrame
Columns: [department_id, department]
Index: []

In [38]:
# describing the data and checking for any anomalies
department_df.describe()

       department_id
count      21.000000
mean       11.000000
std         6.204837
min         1.000000
25%         6.000000
50%        11.000000
75%        16.000000
max        21.000000

In [39]:
# checking data type
department_df.dtypes

department_id     int64
department       object
dtype: object

In [40]:
# checking shape
department_df.shape

(21, 2)

### D. Importing and cleaning orders products prior dataset

In [41]:
# importing orders products prior dataset and assigning to dataframe ords_prior_df 
ords_prior_df = pd.read_csv('/Volumes/external_drive/Instacart/Data/Original Data/order_products__prior.csv')

In [42]:
ords_prior_df.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [43]:
# ddropping add_to_cart_order and reorderd columns as they are not required for analysis
ords_prior_df = ords_prior_df.drop(['add_to_cart_order', 'reordered'], axis = 1)

In [44]:
# checking for missing values
ords_prior_df.isnull().sum()

order_id      0
product_id    0
dtype: int64

In [45]:
# checking for duplicates
ords_prior_df[ords_prior_df.duplicated()]

Empty DataFrame
Columns: [order_id, product_id]
Index: []

In [46]:
# describing the data and checking for any anomalies
ords_prior_df.describe()

           order_id    product_id
count  3.243449e+07  3.243449e+07
mean   1.710749e+06  2.557634e+04
std    9.873007e+05  1.409669e+04
min    2.000000e+00  1.000000e+00
25%    8.559430e+05  1.353000e+04
50%    1.711048e+06  2.525600e+04
75%    2.565514e+06  3.793500e+04
max    3.421083e+06  4.968800e+04

In [47]:
# checking data type
ords_prior_df.dtypes

order_id      int64
product_id    int64
dtype: object

In [48]:
# checking shape
ords_prior_df.shape

(32434489, 2)

### D. Importing and cleaning orders aisles dataset

In [49]:
# importing orders aisles dataset and assigning to dataframe aisle_df 
aisle_df = pd.read_csv('/Volumes/external_drive/Instacart/Data/Original Data/aisles.csv')

In [50]:
aisle_df.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [51]:
# checking for missing values
aisle_df.isnull().sum()

aisle_id    0
aisle       0
dtype: int64

In [52]:
# checking for duplicates
aisle_df[aisle_df.duplicated()]

Empty DataFrame
Columns: [aisle_id, aisle]
Index: []

In [53]:
# describing the data and checking for any anomalies
aisle_df.describe()

         aisle_id
count  134.000000
mean    67.500000
std     38.826537
min      1.000000
25%     34.250000
50%     67.500000
75%    100.750000
max    134.000000

In [54]:
# checking data type
aisle_df.dtypes

aisle_id     int64
aisle       object
dtype: object

In [55]:
# checking shape
aisle_df.shape

(134, 2)

## 2. Merging Datasets

### A. Merging ords_prior_df and order_df

In [56]:
# merging ords_prior_df and order_df using order_id as the merge column
merged_orders_df = order_df.merge(ords_prior_df, on = 'order_id', indicator = False)

In [57]:
merged_df.head()

NameError: name 'merged_df' is not defined

In [ ]:
# checking shape of merged dataset
ords_ordsprior_df.shape

### B. Adding product info to merged_df

In [ ]:
# merging product_df and merged_orders_df using product_id as the merge column
merged_orders_prods_df = merged_orders_df.merge(product_df, on = 'product_id', indicator = False)

In [ ]:
merged_orders_prods_df.head()

In [ ]:
# checking shape of merged dataset
merged_orders_prods_df.shape

### C. Adding department to merged_orders_prods_df

In [ ]:
# merging merged_orders_prods_df and department_df using department_id as the merge column
merged_orders_prods_deps_df = merged_orders_prods_df.merge(department_df, on = 'department_id', indicator = False)

In [ ]:
merged_orders_prods_deps_df.head()

In [ ]:
# checking shape of merged dataset
merged_orders_prods_deps_df.shape

### C. Adding aisle to merged_orders_prods_df

In [ ]:
# merging merged_orders_prods_deps_df and aisle_df using department_id as the merge column
merged_df = merged_orders_prods_deps_df.merge(aisle_df, on = 'aisle_id', indicator = False)

In [ ]:
merged_df.head()

In [ ]:
# checking shape of merged dataset
merged_df.shape

## Exporting Data

In [ ]:
# exporting merged_df to Prepared Data folder
merged_df.to_pickle('/Volumes/external_drive/Instacart/Data/Prepared Data/instacart_merged.pkl')